<template>
  <div id="chart">
    <brand :chartdata="chartData" :options="options"/>
  </div>

</template>

<script>
  import Brand from '@/widgets/Chart/Brand.vue'
  export default {
    components: {
      Brand
    },
    data () {
      return {
        chartData: {
          type: 'line',
          labels: [
            '01.11.2019 - 30.11.2019',
            '01.12.2019 - 31.12.2019',
            '01.01.2020 - 31.01.2020',
            '01.02.2020 - 29.02.2020',
            '01.03.2020 - 31.03.2020',
            '01.04.2020 - 30.04.2020',
            '01.05.2020 - 31.05.2020',
            '01.06.2020 - 30.06.2020',
            '01.07.2020 - 31.07.2020',
            '01.08.2020 - 31.08.2020',
            '01.09.2020 - 30.09.2020',
            '01.10.2020 - 31.10.2020',
            '01.11.2020 - 30.11.2020',
            '01.12.2020 - 31.12.2020',
            '01.01.2021 - 31.01.2021',
            '01.02.2021 - 28.02.2021',
            '01.03.2021 - 31.03.2021',
            '01.04.2021 - 30.04.2021',
            '01.05.2021 - 31.05.2021',
            '01.06.2021 - 30.06.2021',
            '01.07.2021 - 31.07.2021',
            '01.08.2021 - 31.08.2021',
            '01.09.2021 - 30.09.2021',
            '01.10.2021 - 31.10.2021',
          ],
          datasets: [

            {
              label: 'Купить участок Тюмень',
              fill: false,
              data: [
                2824,
                2575,
                4139,
                4452,
                4936,
                6983,
                10912,
                9024,
                7849,
                6861,
                6791,
                7098,
                7288,
                6346,
                8943,
                7975,
                8950,
                10134,
                10110,
                9084,
                8826,
                8365,
                7691,
                8254,
              ],
              borderColor: '#2b2a29',
              backgroundColor: [
                '#FFF'
              ],
            },

            {
              label: 'Купить дом Тюмень',
              fill: false,
              data: [
                21057,
                19577,
                27457,
                27282,
                29989,
                33010,
                44999,
                42952,
                41602,
                40299,
                36704,
                40341,
                38991,
                35271,
                48428,
                41006,
                44397,
                43768,
                41535,
                42623,
                45208,
                44840,
                39943,
                45719,
              ],
              borderColor: 'orange',
              backgroundColor: [
                'white'
              ],
            },

            {
              label: 'Коттеджные поселки',
              fill: false,
              data: [
                2218,
                2114,
                2935,
                3066,
                3223,
                4690,
                7810,
                6781,
                5791,
                5258,
                4282,
                4751,
                4670,
                3484,
                4610,
                4329,
                4919,
                5770,
                5673,
                5218,
                4637,
                4965,
                4168,
                4494,
              ],
              borderColor: '#72a443',
              backgroundColor: [
                '#FFF'
              ],
            },
          ]
        },
        options: {
          responsive: true,
          maintainAspectRatio: false,
          elements: {
            line: {
              fill: false,
              tension: 0,
              borderWidth: 3
            },
          },
        }
      }
    }
  }
</script>

<style scoped>
  #chart > div {
    height: 650px;
  }
</style>
